export const textMap: Record<string, Record<string, string>> = {
  'bold': {
    'a': '𝗮', 'b': '𝗯', 'c': '𝗰', 'd': '𝗱', 'e': '𝗲', 'f': '𝗳', 'g': '𝗴', 'h': '𝗵', 'i': '𝗶', 'j': '𝗷', 'k': '𝗸', 'l': '𝗹',
    'm': '𝗺', 'n': '𝗻', 'o': '𝗼', 'p': '𝗽', 'q': '𝗾', 'r': '𝗿', 's': '𝘀', 't': '𝘁', 'u': '𝘂', 'v': '𝘃', 'w': '𝘄', 'x': '𝘅',
    'y': '𝘆', 'z': '𝘇', 'A': '𝗔', 'B': '𝗕', 'C': '𝗖', 'D': '𝗗', 'E': '𝗘', 'F': '𝗙', 'G': '𝗚', 'H': '𝗛', 'I': '𝗜', 'J': '𝗝',
    'K': '𝗞', 'L': '𝗟', 'M': '𝗠', 'N': '𝗡', 'O': '𝗢', 'P': '𝗣', 'Q': '𝗤', 'R': '𝗥', 'S': '𝗦', 'T': '𝗧', 'U': '𝗨', 'V': '𝗩',
    'W': '𝗪', 'X': '𝗫', 'Y': '𝗬', 'Z': '𝗭'
  },
  'italic': {
    'a': '𝘢', 'b': '𝘣', 'c': '𝘤', 'd': '𝘥', 'e': '𝘦', 'f': '𝘧', 'g': '𝘨', 'h': '𝘩', 'i': '𝘪', 'j': '𝘫', 'k': '𝘬', 'l': '𝘭',
    'm': '𝘮', 'n': '𝘯', 'o': '𝘰', 'p': '𝘱', 'q': '𝘲', 'r': '𝘳', 's': '𝘴', 't': '𝘵', 'u': '𝘶', 'v': '𝘷', 'w': '𝘸', 'x': '𝘹',
    'y': '𝘺', 'z': '𝘻', 'A': '𝘈', 'B': '𝘉', 'C': '𝘊', 'D': '𝘋', 'E': '𝘌', 'F': '𝘍', 'G': '𝘎', 'H': '𝘏', 'I': '𝘐', 'J': '𝘑',
    'K': '𝘒', 'L': '𝘓', 'M': '𝘔', 'N': '𝘕', 'O': '𝘖', 'P': '𝘗', 'Q': '𝘘', 'R': '𝘙', 'S': '𝘚', 'T': '𝘛', 'U': '𝘜', 'V': '𝘝',
    'W': '𝘞', 'X': '𝘟', 'Y': '𝘠', 'Z': '𝘡'
  },
  'underline': {
    'a': '𝗮̲', 'b': '𝗯̲', 'c': '𝗰̲', 'd': '𝗱̲', 'e': '𝗲̲', 'f': '𝗳̲', 'g': '𝗴̲', 'h': '𝗵̲', 'i': '𝗶̲', 'j': '𝗷̲', 'k': '𝗸̲', 'l': '𝗹̲',
    'm': '𝗺̲', 'n': '𝗻̲', 'o': '𝗼̲', 'p': '𝗽̲', 'q': '𝗾̲', 'r': '𝗿̲', 's': '𝘀̲', 't': '𝘁̲', 'u': '𝘂̲', 'v': '𝘃̲', 'w': '𝘄̲', 'x': '𝘅̲',
    'y': '𝘆̲', 'z': '𝘇̲', 'A': '𝗔̲', 'B': '𝗕̲', 'C': '𝗖̲', 'D': '𝗗̲', 'E': '𝗘̲', 'F': '𝗙̲', 'G': '𝗚̲', 'H': '𝗛̲', 'I': '𝗜̲', 'J': '𝗝̲',
    'K': '𝗞̲', 'L': '𝗟̲', 'M': '𝗠̲', 'N': '𝗡̲', 'O': '𝗢̲', 'P': '𝗣̲', 'Q': '𝗤̲', 'R': '𝗥̲', 'S': '𝗦̲', 'T': '𝗧̲', 'U': '𝗨̲', 'V': '𝗩̲',
    'W': '𝗪̲', 'X': '𝗫̲', 'Y': '𝗬̲', 'Z': '𝗭̲'
  }
}